import { Component } from '@angular/core';

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.scss']
})

export class AppComponent {

  // ******************** این سورس، ترکیبی از مفاهیم انگولار رو شامل میشه ********************
  // ***************** البته فعلا دستگرمی هست و روش های بهتری برای پیاده سازی این برنامه وجود داره *****************
  //==================================================================================================================

  constructor() { }

  //===========================================================================
}